app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `users`.`id` = 1 limit 1
select * from `user_ips` where `user_id` = 1 and `ip` = '192.168.65.1' limit 1
insert into `user_ips` (`user_id`, `ip`, `updated_at`, `created_at`) values (1, '192.168.65.1', '2024-02-27 18:22:18', '2024-02-27 18:22:18')
---
    public function store(LoginRequest $request)
    {
        $request->authenticate();

        $request->session()->regenerate();

        if (User::find(auth()->user()->id)->is_delete) {
            Auth::guard('web')->logout();
            $request->session()->invalidate();
            $request->session()->regenerateToken();
            return to_route('login')->with('error', 'Аккаунт был удален!');
        }

        $user_ip = UserIp::where('user_id', auth()->user()->id)->where('ip', $request->ip())->first();
        if (!$user_ip){
            UserIp::create([
                'user_id' => auth()->user()->id,
                'ip' => $request->ip()
            ]);