app/Http/Livewire/Packages/Index.php

    public function mount($id)
    {
        $user_id = auth()->user()->id;
        $this->package = Package::find($id);
        $this->addresses = Address::where('user_id', auth()->user()->id)->get();
---
select * from `packages` where `packages`.`id` = '1' limit 1
select * from `addresses` where `user_id` = 1

    public function add_selected_products()
    {
        foreach ($this->selected_products as $id => $value) {
            if ($value === true) {
                $product = OrderProduct::find($id);
---
select * from `order_products` where `order_products`.`id` = 1 limit 1