app/Http/Livewire/Components/SecurityUpdatePasswordForm.php

    public function submit(){
        $this->validate();

        $user = \auth()->user();
        if (!Hash::check($this->currentPassword, $user->password)) {
            return redirect()->back()->with(['error' => 'Текущий пароль неверный.']);
        }

        $user->password = $this->newPassword;
        $user->save();
---
update `users` set `password` = 'Tim2007tim', `users`.`updated_at` = '2024-02-27 18:23:25' where `id` = 1