app/Http/Livewire/Admin/Document/Form/Table.php

select * from `documents` order by `order` asc
---
    public function mount() {
        $this->documents = Document::orderBy('order', 'ASC')->get();