app/Http/Livewire/Admin/Invoice/Table.php

select * from `invoices` order by `created_at` asc
---
    public function mount() {
        $this->invoices = Invoice::query()->orderBy($this->sort_by, $this->sort_direction)->get();