app/Http/Livewire/Admin/Package/Create.php

select * from `users`
---
    public function mount()
    {
        $this->users = User::all();