app/Http/Livewire/Admin/Package/Table.php

select * from `packages` order by `created_at` desc
select * from `package_statuses`
---
    public function mount(){
        $this->packages = Package::query()->orderBy($this->sort_by, $this->sort_direction)->get();
        $this->package_statuses = PackageStatus::all();