app/Http/Livewire/Admin/Document/User/Create.php

select * from `documents`
select * from `users`
select * from `user_document_statuses`
---
    public function mount() {
        $this->documents = Document::all();
        $this->users = User::all();
        $this->statuses = UserDocumentStatus::all();