app/Http/Livewire/Admin/Document/User/Table.php

select * from `user_documents` order by `created_at` asc
select * from `user_document_statuses`
---
    public function mount() {
        $this->documents = UserDocument::query()->orderBy($this->sort_by, $this->sort_direction)->get();
        $this->statuses = UserDocumentStatus::all();